src/Documents/ВыпускГотовойПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ВыпускГотовойПродукции</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ВыпускГотовойПродукции/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(_, __)
    выполнитьВсеДвиженияДокумента();
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий

#Область СлужебныеПроцедурыИФункции

Процедура выполнитьВсеДвиженияДокумента()
    ЭтотОбъект.Движения.ТоварыНаСкладах.Записывать = Истина;
    выполнитьВсеДвиженияТоваровДокумента();
КонецПроцедуры

Процедура выполнитьВсеДвиженияТоваровДокумента()
    таблицаТоварыДокумента = Документы.ВыпускГотовойПродукции.ПолучитьТоварыДокумента(ЭтотОбъект.Ссылка, Истина);
    Если таблицаТоварыДокумента = Неопределено Тогда // Если таблица не заполнена
        Возврат;
    КонецЕсли;

    Для Каждого строкаТоваров Из таблицаТоварыДокумента Цикл
        выполнитьДвижениеТоварыНаСкладахПриход(строкаТоваров);
    КонецЦикла;
КонецПроцедуры

// Параметры:
//  строкаТоваров - СтрокаТаблицыЗначений, ВыборкаИзРезультатаЗапроса, Структура
//      * Номенклатура - СправочникСсылка.Номенклатура
//      * Количество - Число
Процедура выполнитьДвижениеТоварыНаСкладахПриход(Знач строкаТоваров)
    движение = ЭтотОбъект.Движения.ТоварыНаСкладах.Добавить();
    движение.ВидДвижения = ВидДвиженияНакопления.Приход;
    движение.Период = ЭтотОбъект.Дата;
    движение.Склад = ЭтотОбъект.Склад;
    движение.Номенклатура = строкаТоваров.Номенклатура;
    движение.Количество = строкаТоваров.Количество;
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции
